Repository: xcv58/MacTools
Catalog: Plugins/Translator/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# panelError.screenshotRegionTooSmall
source: 截图区域太小
ar: منطقة لقطة الشاشة صغيرة جدًا
de: Screenshot-Bereich ist zu klein
en: Screenshot region is too small
es: La región de la captura de pantalla es demasiado pequeña
fr: La région de la capture d'écran est trop petite
ja: スクリーンショットの領域が小さすぎます
ko: 스크린샷 영역이 너무 작습니다
pt: A região da captura de tela é muito pequena
ru: Область снимка экрана слишком мала
tr: Ekran görüntüsü alanı çok küçük
zh_hant: 截圖區域太小

# permission.accessibility.description
source: 划词翻译需要读取当前选中文本。
ar: تحتاج ترجمة التحديد إلى قراءة النص المحدد الحالي.
de: Die Auswahlübersetzung muss die aktuelle Auswahl lesen.
en: Selection translation needs to read the current selection.
es: La traducción de selección necesita leer la selección actual.
fr: La traduction de sélection doit lire la sélection actuelle.
ja: 選択範囲の翻訳には、現在の選択内容の読み取りが必要です。
ko: 선택 항목 번역은 현재 선택 내용을 읽어야 합니다.
pt: A tradução da seleção precisa ler a seleção atual.
ru: Для перевода выделенного текста нужно прочитать текущий выбор.
tr: Seçim çevirisi, geçerli seçimi okumak için gereklidir.
zh_hant: 劃詞翻譯需要讀取目前選取的文字。

# permission.accessibility.footnote
source: 前往系统设置 → 隐私与安全性 → 辅助功能，授权 MacTools。
ar: افتح إعدادات النظام > الخصوصية والأمان > إمكانية الوصول واسمح لـ MacTools.
de: Öffnen Sie Systemeinstellungen > Datenschutz & Sicherheit > Bedienungshilfen und erlauben Sie MacTools.
en: Open System Settings > Privacy & Security > Accessibility and allow MacTools.
es: Abre Ajustes del Sistema > Privacidad y seguridad > Accesibilidad y permite MacTools.
fr: Ouvrez Réglages Système > Confidentialité et sécurité > Accessibilité, puis autorisez MacTools.
ja: システム設定 > プライバシーとセキュリティ > アクセシビリティで MacTools を許可します。
ko: 시스템 설정 > 개인정보 보호 및 보안 > 손쉬운 사용에서 MacTools를 허용하세요.
pt: Abra Ajustes do Sistema > Privacidade e Segurança > Acessibilidade e permita MacTools.
ru: Откройте Системные настройки > Конфиденциальность и безопасность > Универсальный доступ и разрешите MacTools.
tr: Sistem Ayarları > Gizlilik ve Güvenlik > Erişilebilirlik bölümünü açıp MacTools'a izin verin.
zh_hant: 前往系統設定 → 隱私權與安全性 → 輔助使用，授權 MacTools。

# permission.accessibility.title
source: 辅助功能授权
ar: إمكانية الوصول
de: Bedienungshilfen
en: Accessibility
es: Accesibilidad
fr: Accessibilité
ja: アクセシビリティ
ko: 손쉬운 사용
pt: Acessibilidade
ru: Универсальный доступ
tr: Erişilebilirlik
zh_hant: 輔助使用授權

# permission.automation.description
source: 浏览器划词可能需要允许 MacTools 控制当前浏览器。
ar: قد تحتاج ترجمة التحديد في المتصفح إلى السماح لـ MacTools بالتحكم في المتصفح الحالي.
de: Die Browser-Auswahlübersetzung benötigt eventuell die Berechtigung, den aktuellen Browser zu steuern.
en: Browser selection translation may need permission for MacTools to control the current browser.
es: La traducción de selección en el navegador puede necesitar permiso para que MacTools controle el navegador actual.
fr: La traduction de sélection dans le navigateur peut nécessiter l’autorisation de contrôler le navigateur actuel.
ja: ブラウザの選択範囲を翻訳するには、MacTools に現在のブラウザの制御を許可する必要がある場合があります。
ko: 브라우저 선택 항목 번역은 MacTools가 현재 브라우저를 제어할 권한이 필요할 수 있습니다.
pt: A tradução de seleção no navegador pode exigir permissão para o MacTools controlar o navegador atual.
ru: Для перевода выделенного текста в браузере MacTools может понадобиться разрешение на управление текущим браузером.
tr: Tarayıcı seçim çevirisi, MacTools'un geçerli tarayıcıyı denetlemesi için izin gerektirebilir.
zh_hant: 瀏覽器劃詞可能需要允許 MacTools 控制目前的瀏覽器。

# permission.automation.footnote
source: macOS 会在首次控制浏览器时请求自动化授权。
ar: سيطلب macOS إذن الأتمتة عند التحكم في المتصفح لأول مرة.
de: macOS fragt beim ersten Steuern eines Browsers nach der Automationsberechtigung.
en: macOS asks for automation permission the first time a browser is controlled.
es: macOS solicita permiso de automatización la primera vez que se controla un navegador.
fr: macOS demande l’autorisation d’automatisation lors du premier contrôle d’un navigateur.
ja: macOS は、ブラウザを初めて制御するときに自動化の許可を求めます。
ko: macOS는 브라우저를 처음 제어할 때 자동화 권한을 요청합니다.
pt: O macOS solicita permissão de automação na primeira vez que um navegador é controlado.
ru: macOS запрашивает разрешение на автоматизацию при первом управлении браузером.
tr: macOS, bir tarayıcı ilk kez denetlendiğinde otomasyon izni ister.
zh_hant: macOS 會在首次控制瀏覽器時要求自動化授權。

# permission.automation.status
source: 按需确认
ar: عند الحاجة
de: Bei Bedarf
en: On demand
es: Bajo demanda
fr: À la demande
ja: 必要時
ko: 필요 시
pt: Sob demanda
ru: По запросу
tr: Gerektiğinde
zh_hant: 按需確認

# permission.automation.title
source: 自动化授权
ar: الأتمتة
de: Automation
en: Automation
es: Automatización
fr: Automatisation
ja: 自動化
ko: 자동화
pt: Automação
ru: Автоматизация
tr: Otomasyon
zh_hant: 自動化授權

# permission.screenRecording.description
source: 截图翻译需要读取框选区域的屏幕内容。
ar: تحتاج ترجمة لقطة الشاشة إلى قراءة منطقة الشاشة المحددة.
de: Die Screenshot-Übersetzung muss den ausgewählten Bildschirmbereich lesen.
en: Screenshot translation needs to read the selected screen region.
es: La traducción de captura necesita leer la región de pantalla seleccionada.
fr: La traduction de capture d’écran doit lire la zone d’écran sélectionnée.
ja: スクリーンショット翻訳には、選択した画面領域の読み取りが必要です。
ko: 스크린샷 번역은 선택한 화면 영역을 읽어야 합니다.
pt: A tradução de captura de tela precisa ler a região selecionada da tela.
ru: Для перевода скриншота нужно прочитать выбранную область экрана.
tr: Ekran görüntüsü çevirisi, seçili ekran alanını okumak için gereklidir.
zh_hant: 截圖翻譯需要讀取框選區域的螢幕內容。

# permission.screenRecording.footnote
source: 请在系统设置 → 隐私与安全性 → 录屏与系统录音（或录屏）中授权 MacTools。
ar: امنح MacTools الإذن في إعدادات النظام ← الخصوصية والأمن ← تسجيل الشاشة وصوت النظام (أو تسجيل الشاشة).
de: MacTools unter Systemeinstellungen → Datenschutz & Sicherheit → Aufnahme von Bildschirm & Systemaudio (oder Bildschirmaufnahme) zulassen.
en: Allow MacTools in System Settings → Privacy & Security → Screen & System Audio Recording (or Screen Recording).
es: Autoriza a MacTools en Ajustes del Sistema → Privacidad y seguridad → Grabación de pantalla y del audio del sistema (o Grabación de pantalla).
fr: Autorisez MacTools dans Réglages Système → Confidentialité et sécurité → Enregistrement de l’écran et des sons du système (ou Enregistrement de l’écran).
ja: システム設定 → プライバシーとセキュリティ → 画面収録とシステムオーディオ録音（または画面収録）で MacTools を許可してください。
ko: 시스템 설정 → 개인정보 보호 및 보안 → 화면 및 시스템 오디오 녹음(또는 화면 기록)에서 MacTools를 허용하세요.
pt: Autorize o MacTools em Ajustes do Sistema → Privacidade e Segurança → Gravação do Áudio do Sistema e da Tela (ou Gravação de Tela).
ru: Разрешите доступ для MacTools в Системных настройках → Конфиденциальность и безопасность → Запись экрана и системного звука (или Запись экрана).
tr: Sistem Ayarları > Gizlilik ve Güvenlik > Ekran Kaydı bölümünü açıp MacTools'a izin verin.
zh_hant: 請在「系統設定」→「隱私權與安全性」→「螢幕與系統錄音」（或「螢幕錄影」）中授權 MacTools。

# permission.screenRecording.title
source: 屏幕录制授权
ar: تسجيل الشاشة
de: Bildschirmaufnahme
en: Screen Recording
es: Grabación de pantalla
fr: Enregistrement de l’écran
ja: 画面収録
ko: 화면 기록
pt: Gravação de Tela
ru: Запись экрана
tr: Ekran Kaydı
zh_hant: 螢幕錄製授權

# providerProfile.error.blankName
source: 服务名称不能为空。
ar: لا يمكن ترك اسم الخدمة فارغًا.
de: Der Dienstname darf nicht leer sein.
en: Service name cannot be empty.
es: El nombre del servicio no puede estar vacío.
fr: Le nom du service ne peut pas être vide.
ja: サービス名を空にすることはできません。
ko: 서비스 이름은 비워둘 수 없습니다.
pt: O nome do serviço não pode ficar vazio.
ru: Имя службы не может быть пустым.
tr: Hizmet adı boş olamaz.
zh_hant: 服務名稱不能為空。

# secretStore.error.security
source: 无法访问钥匙串。
ar: تعذر الوصول إلى سلسلة المفاتيح.
de: Auf den Schlüsselbund konnte nicht zugegriffen werden.
en: Could not access the keychain.
es: No se pudo acceder al llavero.
fr: Impossible d’accéder au trousseau.
ja: キーチェーンにアクセスできませんでした。
ko: 키체인에 접근할 수 없습니다.
pt: Não foi possível acessar o chaveiro.
ru: Не удалось получить доступ к связке ключей.
tr: Keychain'e erişilemedi.
zh_hant: 無法存取鑰匙圈。

# secretStore.error.unexpectedItemData
source: API Key 数据无效。
ar: بيانات API Key غير صالحة.
de: Die API-Key-Daten sind ungültig.
en: API Key data is invalid.
es: Los datos de API Key no son válidos.
fr: Les données d’API Key ne sont pas valides.
ja: API Key データが無効です。
ko: API Key 데이터가 잘못되었습니다.
pt: Os dados da API Key são inválidos.
ru: Данные API Key недействительны.
tr: API Key verileri geçersiz.
zh_hant: API Key 資料無效。

# settings.action.restoreDefaults
source: 恢复默认
ar: استعادة الإعدادات الافتراضية
de: Standardeinstellungen wiederherstellen
en: Restore Defaults
es: Restaurar valores predeterminados
fr: Restaurer les paramètres par défaut
ja: デフォルトに戻す
ko: 기본값 복원
pt: Restaurar padrões
ru: Восстановить настройки по умолчанию
tr: Varsayılanları Geri Yükle
zh_hant: 恢復預設

# settings.action.save
source: 保存
ar: حفظ
de: Speichern
en: Save
es: Guardar
fr: Enregistrer
ko: 저장
pt: Salvar
ru: Сохранить
tr: Kaydet

# settings.defaultPromptTemplate
source: 请将以下文本从 {{source_language}} 翻译为 {{target_language}}，只返回译文。 {{text}}
ar: ترجم النص التالي من {{source_language}} إلى {{target_language}}. أعد الترجمة فقط. {{text}}
de: Übersetze den folgenden Text von {{source_language}} nach {{target_language}}. Gib nur die Übersetzung zurück. {{text}}
en: Translate the following text from {{source_language}} to {{target_language}}. Return only the translation. {{text}}
es: Traduce el siguiente texto de {{source_language}} a {{target_language}}. Devuelve solo la traducción. {{text}}
fr: Traduisez le texte suivant de {{source_language}} vers {{target_language}}. Renvoyez uniquement la traduction. {{text}}
ja: 次のテキストを {{source_language}} から {{target_language}} に翻訳してください。翻訳のみを返してください。 {{text}}
ko: 다음 텍스트를 {{source_language}}에서 {{target_language}}로 번역하세요. 번역문만 반환하세요. {{text}}
pt: Traduza o texto a seguir de {{source_language}} para {{target_language}}. Retorne apenas a tradução. {{text}}
ru: Переведите следующий текст с {{source_language}} на {{target_language}}. Верните только перевод. {{text}}
tr: Aşağıdaki metni {{source_language}} dilinden {{target_language}} diline çevir. Yalnızca çeviriyi döndür. {{text}}
zh_hant: 請將以下文字從 {{source_language}} 翻譯為 {{target_language}}，只返回譯文。 {{text}}

# settings.error.blankAPIKey
source: API Key 不能为空。
ar: لا يمكن ترك API Key فارغًا.
de: API Key darf nicht leer sein.
en: API Key cannot be empty.
es: API Key no puede estar vacía.
fr: API Key ne peut pas être vide.
ja: API Key を空にすることはできません。
ko: API Key는 비워둘 수 없습니다.
pt: API Key não pode ficar vazia.
ru: API Key не может быть пустым.
tr: API Key boş olamaz.
zh_hant: API Key 不能為空。

# settings.error.noEnabledProvider
source: 至少启用一个翻译服务。
ar: فعّل خدمة ترجمة واحدة على الأقل.
de: Aktivieren Sie mindestens einen Übersetzungsdienst.
en: Enable at least one translation service.
es: Activa al menos un servicio de traducción.
fr: Activez au moins un service de traduction.
ja: 少なくとも 1 つの翻訳サービスを有効にしてください。
ko: 번역 서비스를 하나 이상 활성화하세요.
pt: Ative pelo menos um serviço de tradução.
ru: Включите хотя бы одну службу перевода.
tr: En az bir çeviri hizmetini etkinleştirin.
zh_hant: 至少啟用一個翻譯服務。

# settings.error.providerBlankAPIKeyFormat
source: %@：API Key 不能为空。
ar: %@: لا يمكن ترك API Key فارغًا.
de: %@: API Key darf nicht leer sein.
en: %@: API Key cannot be empty.
es: %@: API Key no puede estar vacía.
fr: %@ : API Key ne peut pas être vide.
ja: %@: API Key を空にすることはできません。
ko: %@: API Key는 비워둘 수 없습니다.
pt: %@: API Key não pode ficar vazia.
ru: %@: API Key не может быть пустым.
tr: %@: API Key boş olamaz.
zh_hant: %@：API Key 不能為空。

# settings.error.sameLanguages
source: 两种偏好语言不能相同。
ar: يجب أن تكون اللغتان المفضلتان مختلفتين.
de: Die beiden bevorzugten Sprachen müssen unterschiedlich sein.
en: The two preferred languages must be different.
es: Los dos idiomas preferidos deben ser diferentes.
fr: Les deux langues préférées doivent être différentes.
ja: 2 つの優先言語は異なっていなければなりません。
ko: 두 가지 선호 언어는 서로 달라야 합니다.
pt: Os dois idiomas preferidos devem ser diferentes.
ru: Два предпочтительных языка должны быть разными.
tr: İki tercih edilen dil farklı olmalıdır.
zh_hant: 兩種偏好語言不能相同。

# settings.language.first.description
source: 自动识别为其他语言时翻译到这里。
ar: الترجمة هنا عندما تكون اللغة المكتشفة مختلفة.
de: Hier übersetzen, wenn die erkannte Sprache eine andere ist.
en: Translate here when the detected language is different.
es: Traducir aquí cuando el idioma detectado sea diferente.
fr: Traduisez ici lorsque la langue détectée est différente.
ja: 検出された言語が異なる場合は、ここに翻訳してください。
ko: 감지된 언어가 다른 경우 여기에서 번역하세요.
pt: Traduza aqui quando o idioma detectado for diferente.
ru: Переведите сюда, если обнаружен другой язык.
tr: Algılanan dil farklıysa bu dile çevrilir.
zh_hant: 自動識別為其他語言時翻譯到這裏。

# settings.language.first.title
source: 第一语言
ar: اللغة الأولى
de: Muttersprache
en: First Language
es: Primera lengua
fr: Première langue
ja: 第一言語
ko: 제1언어
pt: Primeira Língua
ru: Первый язык
tr: Birinci Dil
zh_hant: 第一語言

# settings.language.second.description
source: 识别为第一语言时翻译到这里。
ar: الترجمة هنا عند اكتشاف اللغة الأولى.
de: Hier übersetzen, wenn die erste Sprache erkannt wird.
en: Translate here when the first language is detected.
es: Traduce aquí cuando se detecte el primer idioma.
fr: Traduisez ici lorsque la première langue est détectée.
ja: 最初の言語が検出されたら、ここに翻訳します。
ko: 첫 번째 언어가 감지되면 여기에서 번역하세요.
pt: Traduza aqui quando o primeiro idioma for detectado.
ru: Перевести сюда, когда будет определен первый язык.
tr: Birinci dil algılandığında bu dile çevrilir.
zh_hant: 識別為第一語言時翻譯到這裏。

# settings.language.second.title
source: 第二语言
ar: اللغة الثانية
de: Zweite Sprache
en: Second Language
es: Segundo idioma
fr: Langue seconde
ja: 第 2 言語
ko: 제2외국어
pt: Segundo Idioma
ru: Второй язык
tr: İkinci Dil
zh_hant: 第二語言

# settings.language.title
source: 偏好语言
ar: اللغات المفضلة
de: Bevorzugte Sprachen
en: Preferred Languages
es: Idiomas preferidos
fr: Langues préférées
ja: 優先言語
ko: 선호 언어
pt: Idiomas preferidos
ru: Предпочитаемые языки
tr: Tercih Edilen Diller
zh_hant: 偏好語言

# settings.message.saved
source: 已保存
ar: تم الحفظ
de: Gespeichert
en: Saved
es: Guardado
fr: Enregistré
ja: 保存済み
ko: 저장됨
pt: Salvo
ru: Сохранено
tr: Kaydedildi

# settings.prompt.template.description
source: 必须包含 {{text}}。可使用 {{source_language}} 和 {{target_language}}。
ar: يجب أن يتضمن {{text}}. اختياريًا: {{source_language}} و{{target_language}}.
de: Muss {{text}} enthalten. Optional: {{source_language}} und {{target_language}}.
en: Must include {{text}}. Optional: {{source_language}} and {{target_language}}.
es: Debe incluir {{text}}. Opcional: {{source_language}} y {{target_language}}.
fr: Doit inclure {{text}}. Facultatif : {{source_language}} et {{target_language}}.
ja: {{text}} を含める必要があります。{{source_language}} と {{target_language}} も使用できます。
ko: {{text}}을 포함해야 합니다. {{source_language}} 및 {{target_language}}도 사용할 수 있습니다.
pt: Deve incluir {{text}}. Opcional: {{source_language}} e {{target_language}}.
ru: Должен содержать {{text}}. Также можно использовать {{source_language}} и {{target_language}}.
tr: {{text}} içermelidir. İsteğe bağlı: {{source_language}} ve {{target_language}}.
zh_hant: 必須包含 {{text}}。可使用 {{source_language}} 和 {{target_language}}。

# settings.prompt.template.title
source: 模板
ar: القالب
de: Vorlage
en: Template
es: Plantilla
fr: Modèle
ja: テンプレート
ko: 템플릿
pt: Modelo
ru: Шаблон
tr: Şablon

# settings.prompt.title
source: 提示词
ar: الموجّه
de: Prompt
en: Prompt
es: Prompt
fr: Prompt
ja: プロンプト
ko: 프롬프트
pt: Prompt
ru: Промпт
tr: İstem
zh_hant: 提示詞

# settings.provider.apiKey.description
source: 留空则保留当前钥匙串内容。
ar: اتركه فارغًا للاحتفاظ بالقيمة الحالية في سلسلة المفاتيح.
de: Leer lassen, um den aktuellen Schlüsselbundwert beizubehalten.
en: Leave empty to keep the current keychain value.
es: Déjalo vacío para mantener el valor actual del llavero.
fr: Laissez vide pour conserver la valeur actuelle du trousseau.
ja: 現在のキーチェーン値を保持するには空のままにします。
ko: 현재 키체인 값을 유지하려면 비워 두세요.
pt: Deixe em branco para manter o valor atual no chaveiro.
ru: Оставьте пустым, чтобы сохранить текущее значение в связке ключей.
tr: Geçerli Keychain değerini korumak için boş bırakın.
zh_hant: 留空則保留目前的鑰匙圈內容。

# settings.provider.apiKey.title
source: API 密钥
ar: API Key
de: API Key
en: API Key
es: API Key
fr: API Key
ja: API Key
ko: API Key
pt: API Key
ru: API Key
tr: API Key
zh_hant: API 金鑰

# settings.provider.baseURL.description
source: OpenAI 或兼容网关地址。
ar: عنوان OpenAI أو بوابة متوافقة.
de: OpenAI-Adresse oder kompatibles Gateway.
en: OpenAI or compatible gateway address.
es: Dirección de OpenAI o de una puerta de enlace compatible.
fr: Adresse OpenAI ou passerelle compatible.
ja: OpenAI または互換ゲートウェイのアドレス。
ko: OpenAI 또는 호환 게이트웨이 주소입니다.
pt: Endereço da OpenAI ou de gateway compatível.
ru: Адрес OpenAI или совместимого шлюза.
tr: OpenAI veya uyumlu ağ geçidi adresi.
zh_hant: OpenAI 或相容閘道位址。

# settings.provider.fallbackName
source: 翻译服务
ar: خدمة ترجمة
de: Übersetzungsdienst
en: Translation service
es: Servicio de traducción
fr: Service de traduction
ja: 翻訳サービス
ko: 번역 서비스
pt: Serviço de tradução
ru: Служба перевода
tr: Çeviri hizmeti
zh_hant: 翻譯服務

# settings.provider.model.description
source: 用于翻译的模型名称。
ar: اسم النموذج المستخدم للترجمة.
de: Name des Modells für Übersetzungen.
en: Model name used for translation.
es: Nombre del modelo usado para traducir.
fr: Nom du modèle utilisé pour la traduction.
ja: 翻訳に使用するモデル名。
ko: 번역에 사용할 모델 이름입니다.
pt: Nome do modelo usado para tradução.
ru: Имя модели для перевода.
tr: Çeviri için kullanılan model adı.
zh_hant: 用於翻譯的模型名稱。

# settings.provider.model.title
source: 模型
ar: النموذج
de: Modell
en: Model
es: Modelo
fr: Modèle
ja: モデル
ko: 모델
pt: Modelo
ru: Модель
tr: Model

# settings.provider.name.description
source: 显示在翻译结果卡片上。
ar: يظهر على بطاقات نتائج الترجمة.
de: Wird auf den Karten mit Übersetzungsergebnissen angezeigt.
en: Shown on translation result cards.
es: Se muestra en las tarjetas de resultados de traducción.
fr: Affiché sur les cartes de résultat de traduction.
ja: 翻訳結果カードに表示されます。
ko: 번역 결과 카드에 표시됩니다.
pt: Mostrado nos cartões de resultado da tradução.
ru: Отображается на карточках с результатом перевода.
tr: Çeviri sonucu kartlarında gösterilir.
zh_hant: 顯示在翻譯結果卡片上。

# settings.provider.name.title
source: 名称
ar: الاسم
de: Name
en: Name
es: Nombre
fr: Nom
ja: 名前
ko: 이름
pt: Nome
ru: Название
tr: Ad
zh_hant: 名稱

# settings.provider.title
source: OpenAI 兼容服务
ar: خدمة متوافقة مع OpenAI
de: OpenAI-kompatibler Dienst
en: OpenAI-Compatible Provider
es: Proveedor compatible con OpenAI
fr: Fournisseur compatible OpenAI
ja: OpenAI 互換サービス
ko: OpenAI 호환 서비스
pt: Provedor compatível com OpenAI
ru: OpenAI-совместимый провайдер
tr: OpenAI Uyumlu Sağlayıcı
zh_hant: OpenAI 相容服務

# settings.providerDetail.empty
source: 请选择一个翻译服务。
ar: اختر خدمة ترجمة.
de: Wählen Sie einen Übersetzungsdienst aus.
en: Select a translation service.
es: Selecciona un servicio de traducción.
fr: Sélectionnez un service de traduction.
ja: 翻訳サービスを選択してください。
ko: 번역 서비스를 선택하세요.
pt: Selecione um serviço de tradução.
ru: Выберите службу перевода.
tr: Bir çeviri hizmeti seçin.
zh_hant: 請選擇一個翻譯服務。

# settings.providerDetail.title
source: 服务详情
ar: تفاصيل الخدمة
de: Dienstdetails
en: Service Details
es: Detalles del servicio
fr: Détails du service
ja: サービス詳細
ko: 서비스 세부사항
pt: Detalhes do serviço
ru: Сведения о службе
tr: Hizmet Ayrıntıları
zh_hant: 服務詳情

# settings.providerList.add
source: 添加
ar: إضافة
de: Hinzufügen
en: Add
es: Agregar
fr: Ajouter
ja: 追加
ko: 추가
pt: Adicionar
ru: Добавить
tr: Ekle

# settings.providerList.title
source: 翻译服务
ar: خدمات الترجمة
de: Übersetzungsdienste
en: Translation Services
es: Servicios de traducción
fr: Services de traduction
ja: 翻訳サービス
ko: 번역 서비스
pt: Serviços de tradução
ru: Службы перевода
tr: Çeviri Hizmetleri
zh_hant: 翻譯服務

# settings.providerRow.deleteHelp
source: 删除
ar: حذف
de: Löschen
en: Delete
es: Eliminar
fr: Supprimer
ja: 削除
ko: 삭제
pt: Excluir
ru: Удалить
tr: Sil
zh_hant: 刪除

# settings.providerRow.missingModel
source: 未设置模型
ar: لم يتم تعيين نموذج
de: Kein Modell festgelegt
en: No model set
es: Ningún modelo establecido
fr: Aucun modèle défini
ja: モデルが設定されていません
ko: 모델이 설정되지 않았습니다
pt: Nenhum modelo definido
ru: Модель не установлена
tr: Model ayarlanmamış
zh_hant: 未設定模型

# settings.providerRow.moveDownHelp
source: 下移
ar: نقل لأسفل
de: Nach unten
en: Move down
es: Bajar
fr: Descendre
ja: 下に移動
ko: 아래로 이동
pt: Mover para baixo
ru: Переместить вниз
tr: Aşağı taşı

# settings.providerRow.moveUpHelp
source: 上移
ar: نقل لأعلى
de: Nach oben
en: Move up
es: Subir
fr: Monter
ja: 上に移動
ko: 위로 이동
pt: Mover para cima
ru: Переместить вверх
tr: Yukarı taşı

# settings.providerRow.unnamed
source: 未命名服务
ar: خدمة غير مسماة
de: Unbenannter Dienst
en: Unnamed Service
es: Servicio sin nombre
fr: Service sans nom
ja: 名前のないサービス
ko: 이름 없는 서비스
pt: Serviço sem nome
ru: Безымянный сервис
tr: Adsız Hizmet
zh_hant: 未命名服務

# settings.title
source: 翻译设置
ar: إعدادات الترجمة
de: Übersetzungseinstellungen
en: Translation Settings
es: Configuración de traducción
fr: Paramètres de traduction
ja: 翻訳設定
ko: 번역 설정
pt: Configurações de tradução
ru: Настройки перевода
tr: Çeviri Ayarları
zh_hant: 翻譯設定

# shortcut.selectTranslation.description
source: 翻译当前选中的文本。
ar: ترجمة النص المحدد حاليًا.
de: Übersetzen Sie den aktuell ausgewählten Text.
en: Translate the currently selected text.
es: Traducir el texto seleccionado actualmente.
fr: Traduisez le texte actuellement sélectionné.
ja: 現在選択されているテキストを翻訳します。
ko: 현재 선택한 텍스트를 번역합니다.
pt: Traduza o texto atualmente selecionado.
ru: Перевести выделенный в данный момент текст.
tr: Şu anda seçili olan metni çevirir.
zh_hant: 翻譯當前選中的文本。

# shortcut.selectTranslation.title
source: 划词翻译
ar: ترجمة التحديد
de: Auswahl übersetzen
en: Translate Selection
es: Traducir selección
fr: Traduire la sélection
ja: 選択範囲を翻訳
ko: 선택 항목 번역
pt: Traduzir seleção
ru: Перевести выделенное
tr: Seçimi Çevir
zh_hant: 劃詞翻譯

# shortcut.screenshotTranslation.description
source: 框选截图区域并翻译识别出的文字。
ar: حدد منطقة لقطة الشاشة وترجم النص الذي تم التعرف عليه.
de: Wählen Sie einen Screenshot-Bereich aus und übersetzen Sie erkannten Text.
en: Select a screenshot region and translate recognized text.
es: Seleccione una región de captura de pantalla y traduzca el texto reconocido.
fr: Sélectionnez une région de capture d'écran et traduisez le texte reconnu.
ja: スクリーンショットの領域を選択し、認識されたテキストを翻訳します。
ko: 스크린샷 영역을 선택하고 인식된 텍스트를 번역하세요.
pt: Selecione uma região de captura de tela e traduza o texto reconhecido.
ru: Выберите область скриншота и переведите распознанный текст.
tr: Bir ekran görüntüsü alanı seçer ve tanınan metni çevirir.
zh_hant: 框選截圖區域並翻譯識別出的文字。

# shortcut.screenshotTranslation.title
source: 截图翻译
ar: ترجمة لقطة الشاشة
de: Screenshot übersetzen
en: Translate Screenshot
es: Traducir captura de pantalla
fr: Traduire la capture d'écran
ja: スクリーンショットを翻訳
ko: 스크린샷 번역
pt: Traduzir captura de tela
ru: Перевести скриншот
tr: Ekran Görüntüsünü Çevir
zh_hant: 截圖翻譯

# translationPrompt.error.missingTextPlaceholder
source: 提示词必须包含 {{text}}。
ar: يجب أن يتضمن الموجّه {{text}}.
de: Der Prompt muss {{text}} enthalten.
en: The prompt must include {{text}}.
es: El prompt debe incluir {{text}}.
fr: Le prompt doit inclure {{text}}.
ja: プロンプトには {{text}} を含めてください。
ko: 프롬프트에는 {{text}}이 포함되어야 합니다.
pt: O prompt deve incluir {{text}}.
ru: Промпт должен содержать {{text}}.
tr: İstem {{text}} içermelidir.
zh_hant: 提示詞必須包含 {{text}}。

# ocr.error.emptyResult
source: 截图中没有识别到文字。
ar: لم يتم التعرف على أي نص في لقطة الشاشة.
de: Im Screenshot wurde kein Text erkannt.
en: No text was recognized in the screenshot.
es: No se reconoció ningún texto en la captura de pantalla.
fr: Aucun texte n'a été reconnu dans la capture d'écran.
ja: スクリーンショットでテキストが認識されませんでした。
ko: 스크린샷에서 텍스트가 인식되지 않았습니다.
pt: Nenhum texto foi reconhecido na captura de tela.
ru: На снимке экрана не распознан текст.
tr: Ekran görüntüsünde metin tanınamadı.
zh_hant: 截圖中沒有識別到文字。
